Revit 2015 API
DirectShapeType.SetShape Method
 Sets the type shape to a copy of the supplied collection of Geometry objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public void SetShape(
	IList<GeometryObject> pGeomArr
)
Visual Basic
Public Sub SetShape ( _
	pGeomArr As IList(Of GeometryObject) _
)
Visual C++
public:
void SetShape(
	IList<GeometryObject^>^ pGeomArr
)
Parameters
pGeomArr
Type: System.Collections.Generic.IList<GeometryObject>
 Shape of this object expressed as a collection of Geometry objects. These will be copied. Shape and Category should be consistent: geometry supplied as shape should be valid for the Category the type object is associated with.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace